/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   타일 채우기.c                                 :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: gunkim <papawolf@kakao.com>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/12/07 18:19:56 by gunkim            #+#    #+#             */
/*   Updated: 2020/12/07 18:51:48 by gunkim           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

int		main(void)
{
	int		n, i;
	int		mem[31][3] = {0};

	scanf("%d", &n);
	if (n % 2 != 0)
	{
		printf("%d", mem[n][0] + mem[n][1] + mem[n][2]);
		return (0);
	}
	mem[2][0] = 1;
	mem[2][1] = 1;
	mem[2][2] = 1;
	i = 4;
	while (i <= n)
	{
		mem[i][0] = mem[i - 2][0] * 2 + mem[i - 2][1] + mem[i - 2][2];
		mem[i][1] = mem[i - 2][0] + mem[i - 2][1] * 2 + mem[i - 2][2];
		mem[i][2] = mem[i - 2][0] + mem[i - 2][1] + mem[i - 2][2];
		printf("mem[%d] : %d\n", i, mem[i][0] + mem[i][1] + mem[i][2]);
		i += 2;
	}
	printf("%d", mem[n][0] + mem[n][1] + mem[n][2]);
}
